# coding:utf-8
import random, sys

reload(sys)
sys.setdefaultencoding("utf-8")


def getName():
	familyNames = [
		"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
		"褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
		"何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
		"陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
		"云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
		"昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
		"酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
		"倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
		"乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
		"元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹"
		]
	
	LastNames = [
		"子璇", "淼", "国栋", "夫子", "瑞堂", "甜", "敏", "尚", "国贤", "贺祥", "晨涛",
		"昊轩", "易轩", "益辰", "益帆", "益冉", "瑾春", "瑾昆", "春齐", "杨", "文昊",
		"东东", "雄霖", "浩晨", "熙涵", "溶溶", "冰枫", "欣欣", "宜豪", "欣慧", "建政",
		"美欣", "淑慧", "文轩", "文杰", "欣源", "忠林", "榕润", "欣汝", "慧嘉", "新建",
		"建林", "亦菲", "林", "冰洁", "佳欣", "涵涵", "禹辰", "淳美", "泽惠", "伟洋",
		"涵越", "润丽", "翔", "淑华", "晶莹", "凌晶", "苒溪", "雨涵", "嘉怡", "佳毅",
		"子辰", "佳琪", "紫轩", "瑞辰", "昕蕊", "萌", "明远", "欣宜", "泽远", "欣怡",
		"佳怡", "佳惠", "晨茜", "晨璐", "运昊", "汝鑫", "淑君", "晶滢", "润莎", "榕汕",
		"佳钰", "佳玉", "晓庆", "一鸣", "语晨", "添池", "添昊", "雨泽", "雅晗", "雅涵",
		"清妍", "诗悦", "嘉乐", "晨涵", "天赫", "玥傲", "佳昊", "天昊", "萌萌", "若萌"
		]
	
	i = random.randint(1, 100)
	f_name = familyNames[i]
	j = random.randint(1, 100)
	l_name = LastNames[j]
	name = f_name + l_name
	return name


if __name__ == '__main__':
	print getName()
	cust_info = {
		'_cust_base_info': {
			'product': u'E押通-2.0(一押)',  # 贷款产品
			'apply_amount': 500000,  # 申请金额
			'apply_period': 36,  # 贷款期数
			'branch_manager_name': u"小明",
			'branch_manager': "xn111",
			'apply_module_team_group_name': u"A队",
			'team_manager_name': u"小王",
			'team_manager': "xn0001",
			'sale_name': u"王刚",
			'module_sale': "xn0002",
			'module_month_income': 3000,
			'checkApprove': u"同意",
			},
		'_borrow_info': {
			'name': getName(),
			'id_num': '360101199101011054',
			'phone': "13564789215",
			'address': u"湖南长沙",
			'company': u'小牛普惠管理有限公司',
			'job': u'工程师',
			'entry_date': u'2011-02-03',  # 入职日期
			'work_year': 5,  # 工作年限
			'monthly_incoming': 15000  # 月均收入
			}
		}
	
	# cust_info['_borrow_info']['name'] = getName()
	print cust_info['_borrow_info']['name']
